 
Процедура ЗавершитьНекорректныеСеансы() Экспорт 
	
	//Логгер = ЛогированиеОбщий.ИнициироватьЛоггер("ЗавершениеНекорректныхСеансовПользователей");
	//У нас используется graylog куда мы закидываем какие то логи, тут просто оставим переменную
	Логгер = "ЗавершениеНекорректныхСеансовПользователей";

	ВремяВыбораОтключенияСеанса = ТекущаяДата();
	СеансыИсключенные = Новый Массив; //либо админы, либо уже отключенные сеансы 
	ОписаниеСоединений = Новый Соответствие;		
	СписокСеансов = Новый Массив;
	ИспользованныеНомераСеансов = Новый Массив;
	
	ЗначениеЛимитВремениФоновогоЗадания = Константы.Е_ЛимитВремениФоновогоЗадания.Получить()*60;
	ЗначениеЛимитВремениФоновогоЗадания = ?(ЗначениеЛимитВремениФоновогоЗадания = 0, 40*60, ЗначениеЛимитВремениФоновогоЗадания);
	ЛимитВремениФоновогоЗадания = ТекущаяДата() - ЗначениеЛимитВремениФоновогоЗадания; 
	ЛимитВремениВСекундах = Константы.Е_ЛимитВремениВыполненияЗапроса.Получить();  
	ЛимитТекущейПамятиСоединения = Константы.Е_ЛимитТекущейПамятиСоединения.Получить();
	РазрешитьДвеСесии = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("РазрешитьДвеСесии", Истина);
	
	ПриложенияДляОтмены = СтрРазделить("1CV8,1CV8C", ",");	
	
	ПараметрыИБ = АдминистрированиеКластера.ПараметрыАдминистрированияИнформационнойБазыКластера();
	ЗаполнитьЗначенияСвойств(ПараметрыИБ, ПараметрыВременногоПользователя());
	//Данные настройки вынесены в отдельный справочник у нас
	ПараметрыКластера = ПолучитьПараметрыКластера();

	// 1. получим все текущие сеансы и соединим их пользователями ИБ
	СеансыИБД = АдминистрированиеКластера.СеансыИнформационнойБазы(ПараметрыКластера, ПараметрыИБ);
	ТаблицаПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
	соотПользователей = Новый Соответствие;
	Для каждого Пользователь Из ТаблицаПользователей Цикл
		соотПользователей.Вставить(Пользователь.Имя, Пользователь.УникальныйИдентификатор);
	КонецЦикла;
	
	Если СеансыИБД.Количество() Тогда
		ТаблицаСеансов = Новый ТаблицаЗначений;
		ТаблицаСеансов.Колонки.Добавить("ИмяПользователя",					  Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(60, ДопустимаяДлина.Переменная)));
		ТаблицаСеансов.Колонки.Добавить("ИдентификаторКлиентскогоПриложения", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная)));
		ТаблицаСеансов.Колонки.Добавить("ВремяНачала",						  Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		ТаблицаСеансов.Колонки.Добавить("ДлительностьВызововСУБДТекущее",	  Новый ОписаниеТипов("Число",	 Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
		ТаблицаСеансов.Колонки.Добавить("ПотреблениеПамятиТекущее",		 	  Новый ОписаниеТипов("Число",	 Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
		ТаблицаСеансов.Колонки.Добавить("Номер",		 	  				  Новый ОписаниеТипов("Число",	 Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
		ТаблицаСеансов.Колонки.Добавить("ИдентификаторСеанса",				  Новый ОписаниеТипов("УникальныйИдентификатор"));
		ТаблицаСеансов.Колонки.Добавить("Сеанс",							  Новый ОписаниеТипов("АдминистрированиеСеанс"));
		ТаблицаСеансов.Колонки.Добавить("ИдентификаторПользователяИБ",  	  Новый ОписаниеТипов("УникальныйИдентификатор"));
		
		Для каждого Сеанс Из СеансыИБД Цикл 
			НоваяСтрока = ТаблицаСеансов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Сеанс); 
			НоваяСтрока.Сеанс = Сеанс;
			НоваяСтрока.ИдентификаторПользователяИБ = соотПользователей[Сеанс.ИмяПользователя];
		КонецЦикла;
	Иначе	
		Возврат;
	КонецЕсли;	
	
    ВтТаблицаСеансов = Новый МенеджерВременныхТаблиц;  
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ПриложенияДляОтмены", ПриложенияДляОтмены);
	Запрос.УстановитьПараметр("ЛимитВремениВыполненияЗапроса", ЛимитВремениВСекундах * 1000);
	Запрос.УстановитьПараметр("ЛимитТекущейПамятиСоединения", ЛимитТекущейПамятиСоединения); 
	Запрос.УстановитьПараметр("ЛимитВремениФоновогоЗадания", ЛимитВремениВСекундах);
	Запрос.УстановитьПараметр("ВремяВыбораОтключенияСеанса", ВремяВыбораОтключенияСеанса);
	Запрос.МенеджерВременныхТаблиц = ВтТаблицаСеансов;
	Запрос.УстановитьПараметр("ТаблицаСеансов", ТаблицаСеансов);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТаблицаСеансов.ИмяПользователя КАК СТРОКА(60)) КАК ИмяПользователя,
		|	ВЫРАЗИТЬ(ТаблицаСеансов.ИдентификаторКлиентскогоПриложения КАК СТРОКА(150)) КАК ИмяПриложения,
		|	ВЫРАЗИТЬ(ТаблицаСеансов.ДлительностьВызововСУБДТекущее КАК ЧИСЛО) КАК ДлительностьТекущегоВызоваСУБД,
		|	ВЫРАЗИТЬ(ТаблицаСеансов.ВремяНачала КАК ДАТА) КАК НачалоСеанса,
		|	ТаблицаСеансов.ИдентификаторСеанса КАК ИдентификаторСеанса,
		|	ТаблицаСеансов.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ,
		|	ВЫРАЗИТЬ(ТаблицаСеансов.ПотреблениеПамятиТекущее КАК ЧИСЛО) КАК ПотреблениеПамятиТекущее,
		|	ВЫРАЗИТЬ(ТаблицаСеансов.Номер КАК ЧИСЛО) КАК Номер
		|ПОМЕСТИТЬ ВтТаблицаСеансов
		|ИЗ
		|	&ТаблицаСеансов КАК ТаблицаСеансов";
	
	РезультатЗапроса = Запрос.Выполнить();
	 
	//2. Отберем те сеансы пользователей, которые выполняются больше 10 минут
	Запрос.Текст = ТекстЗапросаСеансовСПревышениемЛимитаВремениВыполнения();
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		ОбработкаРезультатаНекорректныеСеансы(ВыборкаДетальныеЗаписи, ТаблицаСеансов, ОписаниеСоединений, СеансыИсключенные, СписокСеансов);			
	КонецЦикла;	
	
	Если СписокСеансов.Количество() > 0  Тогда
		допСтруктураЛоггера = Новый Структура("subProc, timeLimit", "ЗавершениеСеансовСПревышениемЛимитаВремениВыполнения", ЛимитВремениВСекундах);
		ЗавершитьВыбранныеСеансыСоединения(ПараметрыИБ, СписокСеансов, ОписаниеСоединений, Логгер, допСтруктураЛоггера);
		ОбновитьТаблицуСеансов(ВтТаблицаСеансов, СеансыИсключенные);
		СписокСеансов.Очистить();
		ОписаниеСоединений.Очистить();
		СеансыИсключенные.Очистить();
	КонецЕсли;
	
	// 2. отберем те сеансы пользователей, которые отожрали памяти больше установленного лимита	
	Запрос.Текст = ТекстЗапросаСеансовСПревышениемЛимитаПамятиСервера();
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		ОбработкаРезультатаНекорректныеСеансы(ВыборкаДетальныеЗаписи, ТаблицаСеансов, ОписаниеСоединений, СеансыИсключенные, СписокСеансов);			
	КонецЦикла;	
	
	Если СписокСеансов.Количество() > 0  Тогда
		допСтруктураЛоггера = Новый Структура("subProc, memoryLimit", "ЗавершениеСеансовСПревышениемЛимитаПамятиСервера", ЛимитТекущейПамятиСоединения);
		ЗавершитьВыбранныеСеансыСоединения(ПараметрыИБ, СписокСеансов, ОписаниеСоединений, Логгер, допСтруктураЛоггера); 
		ОбновитьТаблицуСеансов(ВтТаблицаСеансов, СеансыИсключенные); 
		СеансыИсключенные.Очистить(); 
		СписокСеансов.Очистить();
		ОписаниеСоединений.Очистить();
	КонецЕсли;
	
	// 3. Закроем принудительно все фоновые задания, запущенные пользователями напрямую (например формирование длительных отчетов) длительность которых больше 40 минут
	Запрос.Текст = ТекстЗапросаФоновыхПользователей();
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		ОбработкаРезультатаНекорректныеСеансы(ВыборкаДетальныеЗаписи, ТаблицаСеансов, ОписаниеСоединений, СеансыИсключенные, СписокСеансов);			
	КонецЦикла;	
	
	Если СписокСеансов.Количество() > 0  Тогда
		допСтруктураЛоггера = Новый Структура("subProc, timeLimit", "ЗавершениеФоновыхСПревышениемЛимитаВремениВыполнения", ЛимитВремениВСекундах);
		ЗавершитьВыбранныеСеансыСоединения(ПараметрыИБ, СписокСеансов, ОписаниеСоединений, Логгер, допСтруктураЛоггера);
		ОбновитьТаблицуСеансов(ВтТаблицаСеансов, СеансыИсключенные);
		СеансыИсключенные.Очистить(); 
		СписокСеансов.Очистить();
		ОписаниеСоединений.Очистить();
	КонецЕсли;
	
	// 4. проверить наличие дублей, которые необходимо закрыть	
	Запрос.Текст = ТекстЗапросаДублейСеансов();	
	Запрос.УстановитьПараметр("РазрешитьДвеСесии", РазрешитьДвеСесии);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		ОбработкаРезультатаНекорректныеСеансы(ВыборкаДетальныеЗаписи, ТаблицаСеансов, ОписаниеСоединений, СеансыИсключенные, СписокСеансов);			
	КонецЦикла;	
	
	Если СписокСеансов.Количество() > 0  Тогда
		допСтруктураЛоггера = Новый Структура("subProc", "ЗавершениеДублейСеансов");
		ЗавершитьВыбранныеСеансыСоединения(ПараметрыИБ, СписокСеансов, ОписаниеСоединений, Логгер, допСтруктураЛоггера);
	КонецЕсли;
		
	СписокСеансов.Очистить();
	ОписаниеСоединений.Очистить(); 
	
	ВтТаблицаСеансов.Закрыть();
	
	Попытка
		УдалитьПользователяИБ_(ПараметрыИБ.ИмяАдминистратораИнформационнойБазы);
	Исключение
		//ЛогированиеОбщий.ОтправитьСообщениеЛога_Ошибка(Логгер, , НСтр("ru = 'Ошибка удаления служебного пользователя'; en = 'Service user deletion error'"));
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбработкаРезультатаНекорректныеСеансы(ВыборкаДетальныеЗаписи, ТаблицаСеансов, ОписаниеСоединений, СеансыИсключенные, СписокСеансов)
	
	ИмяПользователя = СокрП(ВыборкаДетальныеЗаписи.ИмяПользователя);
	
	//Тут по идее надо делать заранее в запросе, смотреть справочник профили групп доступа. Но у нас в ДНС справочника профили нету
	//хотя тут право доступа и настройки ролей может поменяться
	Если ПравоДоступа("Администрирование", Метаданные, ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя)) 
		Или ПравоДоступа("АдминистрированиеДанных", Метаданные, ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя)) 
		Тогда
		СеансыИсключенные.Вставить(ВыборкаДетальныеЗаписи.Номер);
		Возврат;	
	КонецЕсли;
	
	НайденныеСеансы = ТаблицаСеансов.НайтиСтроки(Новый Структура("Номер", ВыборкаДетальныеЗаписи.Номер));  
	
	Для каждого Стр Из НайденныеСеансы Цикл
		Сеанс = Стр.Сеанс;
		ТекОписание = Новый Структура("Сеанс", Сеанс);
		СписокСеансов.Добавить(Стр.Номер);  
		ОписаниеСоединений.Вставить(Сеанс.ИдентификаторСеанса, ТекОписание);
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОбновитьТаблицуСеансов(ВтТаблицаСеансов, СеансыИсключенные)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ВтТаблицаСеансов; 
	Запрос.УстановитьПараметр("СеансыИсключенные", СеансыИсключенные);
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ПОМЕСТИТЬ ВтНоваяТаблицаСеансов
		|ИЗ
		|	ВтТаблицаСеансов КАК ВтТаблицаСеансов
		|ГДЕ
		|	НЕ ВтТаблицаСеансов.ИдентификаторСеанса В (&СеансыИсключенные)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВтТаблицаСеансов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ *
		|ПОМЕСТИТЬ ВтТаблицаСеансов
		|ИЗ
		|	ВтНоваяТаблицаСеансов КАК ВтНоваяТаблицаСеансов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВтНоваяТаблицаСеансов";
	
	РезультатЗапроса = Запрос.Выполнить();

КонецПроцедуры

#Область ЗавершенияНекорректныхСеансов

Процедура ЗавершитьВыбранныеСеансыСоединения(ПараметрыИБ, СеансыКОтключению, СоединенияКОтключению, Логгер, допСтруктураЛоггера)
	
	ПараметрыКластера = ПолучитьПараметрыКластера();
	
	ПриложенияДляОтмены = Новый Массив;
	ПриложенияДляОтмены.Добавить("1CV8");
	ПриложенияДляОтмены.Добавить("1CV8C");
	ПриложенияДляОтмены.Добавить("BackgroundJob");
	
	МассивФильтров = Новый Массив;
	ФильтрСеансов = АдминистрированиеКластера.ФильтрСеансов();
	ФильтрСеансов.Свойство = "Номер";
	ФильтрСеансов.ВидСравнения = ВидСравнения.ВСписке;
	ФильтрСеансов.Значение = СеансыКОтключению;
	МассивФильтров.Добавить(ФильтрСеансов);
	
	АдминистрированиеКластера.УдалитьСеансыИнформационнойБазы(ПараметрыКластера, ПараметрыИБ, МассивФильтров);	 
	
КонецПроцедуры

#КонецОбласти

#Область ТекстыЗапросовНекорректныхСеансов

Функция ТекстЗапросаСеансовСПревышениемЛимитаВремениВыполнения()
	
	Текст = 
		"ВЫБРАТЬ
		|	ВтТаблицаСеансов.ИмяПользователя КАК ИмяПользователя,
		|	ВтТаблицаСеансов.ИдентификаторСеанса КАК ИдентификаторСеанса,
		|	ВтТаблицаСеансов.ИмяПриложения КАК ИмяПриложения
		|ИЗ
		|	ВтТаблицаСеансов КАК ВтТаблицаСеансов
		|ГДЕ
		|	ВтТаблицаСеансов.ИмяПриложения В(&ПриложенияДляОтмены)
		|	И ВтТаблицаСеансов.ДлительностьТекущегоВызоваСУБД > &ЛимитВремениВыполненияЗапроса";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаСеансовСПревышениемЛимитаПамятиСервера()
	
	Текст = 
		"ВЫБРАТЬ
		|	ВтТаблицаСеансов.ИмяПользователя КАК ИмяПользователя,
		|	ВтТаблицаСеансов.ИдентификаторСеанса КАК ИдентификаторСеанса,
		|	ВтТаблицаСеансов.ИмяПриложения КАК ИмяПриложения
		|ИЗ
		|	ВтТаблицаСеансов КАК ВтТаблицаСеансов
		|ГДЕ
		|	ВтТаблицаСеансов.ИмяПриложения В(&ПриложенияДляОтмены)
		|	И ВтТаблицаСеансов.ПотреблениеПамятиТекущее > &ЛимитТекущейПамятиСоединения";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаФоновыхПользователей()
	
	Текст = 
		"ВЫБРАТЬ
		|	ВтТаблицаСеансов.ИмяПользователя КАК ИмяПользователя,
		|	ВтТаблицаСеансов.ИдентификаторСеанса КАК ИдентификаторСеанса,
		|	ВтТаблицаСеансов.ИмяПриложения КАК ИмяПриложения,
		|	Пользователи.Ссылка КАК ПользовательСсылка
		|ИЗ
		|	ВтТаблицаСеансов КАК ВтТаблицаСеансов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ВтТаблицаСеансов.ИдентификаторПользователяИБ = Пользователи.ИдентификаторПользователяИБ
		|ГДЕ
		|	ВтТаблицаСеансов.ИмяПриложения = ""BackgroundJob""
		|	И ВтТаблицаСеансов.ИмяПользователя <> """"
		|	И ВтТаблицаСеансов.НачалоСеанса < &ЛимитВремениФоновогоЗадания";
	
	Возврат Текст;
	
КонецФункции 

Функция ТекстЗапросаДублейСеансов()
	
	Текст = 
		"ВЫБРАТЬ
		|	ВтТаблицаСеансов.ИмяПользователя КАК ИмяПользователя,
		|	ВтТаблицаСеансов.ИмяПриложения КАК ИмяПриложения,
		|	КОЛИЧЕСТВО(ВтТаблицаСеансов.ИмяПриложения) КАК КоличествоСессий,
		|	Пользователи.Ссылка КАК ПользовательСсылка
		|ПОМЕСТИТЬ ТаблицаПользователей
		|ИЗ
		|	ВтТаблицаСеансов КАК ВтТаблицаСеансов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ВтТаблицаСеансов.ИдентификаторПользователяИБ = Пользователи.ИдентификаторПользователяИБ
		|ГДЕ
		|	ВтТаблицаСеансов.ИмяПриложения В(&ПриложенияДляОтмены)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтТаблицаСеансов.ИмяПользователя,
		|	ВтТаблицаСеансов.ИмяПриложения,
		|	Пользователи.Ссылка
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ВтТаблицаСеансов.ИмяПриложения) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПользователей.ИмяПользователя КАК ИмяПользователя,
		|	ТаблицаПользователей.ИмяПриложения КАК ИмяПриложения,
		|	ТаблицаПользователей.ПользовательСсылка КАК ПользовательСсылка,
		|	ВЫБОР
		|		КОГДА ДополнительныеСведения.Значение ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК РазрешеноДвеСессии,
		|	МАКСИМУМ(ВтТаблицаСеансов.НачалоСеанса) КАК МаксНачалоСеанса,
		|	МАКСИМУМ(ВтТаблицаСеансов.Номер) КАК Номер
		|ПОМЕСТИТЬ ВТМаксПериодСеансов
		|ИЗ
		|	ТаблицаПользователей КАК ТаблицаПользователей
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ТаблицаПользователей.ПользовательСсылка = ДополнительныеСведения.Объект
		|			И (ДополнительныеСведения.Свойство = &РазрешитьДвеСесии)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТаблицаСеансов КАК ВтТаблицаСеансов
		|		ПО ТаблицаПользователей.ИмяПользователя = ВтТаблицаСеансов.ИмяПользователя
		|			И ТаблицаПользователей.ИмяПриложения = ВтТаблицаСеансов.ИмяПриложения
		|ГДЕ
		|	ТаблицаПользователей.ИмяПользователя <> """"
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПользователей.ИмяПользователя,
		|	ТаблицаПользователей.ИмяПриложения,
		|	ТаблицаПользователей.ПользовательСсылка,
		|	ВЫБОР
		|		КОГДА ДополнительныеСведения.Значение ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЗ.ИмяПользователя КАК ИмяПользователя,
		|	ВЗ.ПользовательСсылка КАК ПользовательСсылка,
		|	ВЗ.НачалоСеанса КАК НачалоСеанса,
		|	ВЗ.Номер КАК Номер,
		|	ВтТаблицаСеансов.ИмяПриложения КАК ИмяПриложения,
		|	ВЗ.РазрешеноДвеСессии КАК РазрешеноДвеСессии
		|ПОМЕСТИТЬ ВТМаксСеансыРазрешеные
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТМаксПериодСеансов.ИмяПользователя КАК ИмяПользователя,
		|		ВТМаксПериодСеансов.ПользовательСсылка КАК ПользовательСсылка,
		|		МАКСИМУМ(ВтТаблицаСеансов.НачалоСеанса) КАК НачалоСеанса,
		|		МАКСИМУМ(ВтТаблицаСеансов.Номер) КАК Номер,
		|		ВТМаксПериодСеансов.РазрешеноДвеСессии КАК РазрешеноДвеСессии
		|	ИЗ
		|		ВТМаксПериодСеансов КАК ВТМаксПериодСеансов
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТаблицаСеансов КАК ВтТаблицаСеансов
		|			ПО ВТМаксПериодСеансов.ИмяПользователя = ВтТаблицаСеансов.ИмяПользователя
		|				И ВТМаксПериодСеансов.ИмяПриложения = ВтТаблицаСеансов.ИмяПриложения
		|				И ВТМаксПериодСеансов.Номер <> ВтТаблицаСеансов.Номер
		|				И ВТМаксПериодСеансов.МаксНачалоСеанса >= ВтТаблицаСеансов.НачалоСеанса
		|	ГДЕ
		|		ВТМаксПериодСеансов.РазрешеноДвеСессии
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТМаксПериодСеансов.ИмяПользователя,
		|		ВТМаксПериодСеансов.ПользовательСсылка,
		|		ВТМаксПериодСеансов.РазрешеноДвеСессии) КАК ВЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТаблицаСеансов КАК ВтТаблицаСеансов
		|		ПО ВЗ.ИмяПользователя = ВтТаблицаСеансов.ИмяПользователя
		|			И ВЗ.НачалоСеанса = ВтТаблицаСеансов.НачалоСеанса
		|			И ВЗ.Номер = ВтТаблицаСеансов.Номер
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТМаксПериодСеансов.ИмяПользователя,
		|	ВТМаксПериодСеансов.ПользовательСсылка,
		|	ВТМаксПериодСеансов.МаксНачалоСеанса,
		|	ВТМаксПериодСеансов.Номер,
		|	ВТМаксПериодСеансов.ИмяПриложения,
		|	ВТМаксПериодСеансов.РазрешеноДвеСессии
		|ИЗ
		|	ВТМаксПериодСеансов КАК ВТМаксПериодСеансов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТМаксСеансыРазрешеные.ИмяПользователя КАК ИмяПользователя,
		|	ВТМаксСеансыРазрешеные.ИмяПриложения КАК ИмяПриложения,
		|	ВТМаксСеансыРазрешеные.ПользовательСсылка КАК ПользовательСсылка,
		|	ВтТаблицаСеансов.Номер КАК Номер
		|ИЗ
		|	ВТМаксСеансыРазрешеные КАК ВТМаксСеансыРазрешеные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТаблицаСеансов КАК ВтТаблицаСеансов
		|		ПО ВТМаксСеансыРазрешеные.ИмяПользователя = ВтТаблицаСеансов.ИмяПользователя
		|			И ВТМаксСеансыРазрешеные.ИмяПриложения = ВтТаблицаСеансов.ИмяПриложения
		|			И ВТМаксСеансыРазрешеные.Номер <> ВтТаблицаСеансов.Номер
		|ГДЕ
		|	НЕ ВтТаблицаСеансов.Номер В
		|				(ВЫБРАТЬ
		|					ВТМаксСеансыРазрешеные.Номер КАК Номер
		|				ИЗ
		|					ВТМаксСеансыРазрешеные КАК ВТМаксСеансыРазрешеные)
		|	И ВтТаблицаСеансов.НачалоСеанса < &ВремяВыбораОтключенияСеанса
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТМаксСеансыРазрешеные.ИмяПользователя,
		|	ВТМаксСеансыРазрешеные.ИмяПриложения,
		|	ВТМаксСеансыРазрешеные.ПользовательСсылка,
		|	ВтТаблицаСеансов.Номер";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

Функция ПолучитьПараметрыКластера()
	ПараметрыКластера = АдминистрированиеКластера.ПараметрыАдминистрированияКластера();	
	ПараметрыКластера.АдресСервераАдминистрирования = "127.0.0.1";
	ПараметрыКластера.АдресАгентаСервера = "localhost";
	ПараметрыКластера.ТипПодключения = "RAS";
	Возврат ПараметрыКластера;
КонецФункции

#Область НеМое
// Создает служебного пользователя и возвращает его параметры
// 
// Возвращаемое значение:
//   - Структура:
//		* ИмяАдминистратораИнформационнойБазы - Строка - Логин
//		* ПарольАдминистратораИнформационнойБазы - Строка - Пароль
//
Функция ПараметрыВременногоПользователя() Экспорт
	
	Результат = Новый Структура("ИмяАдминистратораИнформационнойБазы, ПарольАдминистратораИнформационнойБазы, ИмяВКластере", "", "", "");
	
	СлужебноеИмя = СтрШаблон("usrForKillProcess%1", Формат(НомерСеансаИнформационнойБазы(), "ЧГ=0"));
	ВремПароль = Строка(Новый УникальныйИдентификатор);
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(СлужебноеИмя);
	Если Пользователь = Неопределено Тогда
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	КонецЕсли;
	Пользователь.Имя = СлужебноеИмя;
	Пользователь.АутентификацияСтандартная = Истина;
	Пользователь.ПоказыватьВСпискеВыбора = Ложь;
	Пользователь.ПолноеИмя = Пользователь.Имя;
	Пользователь.Язык = Метаданные.Языки.Русский;
	Пользователь.Пароль = ВремПароль;
	Пользователь.Роли.Очистить();
	Пользователь.Роли.Добавить(Метаданные.Роли.АдминистраторСистемы);
	Пользователь.Роли.Добавить(Метаданные.Роли.Администрирование);
	Пользователь.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
	Пользователь.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
	Пользователь.РежимЗапуска = РежимЗапускаКлиентскогоПриложения.Авто;
	Пользователь.Записать();
	
	Результат.ИмяАдминистратораИнформационнойБазы = СлужебноеИмя;
	Результат.ПарольАдминистратораИнформационнойБазы = ВремПароль;
	Результат.ИмяВКластере = "UT";
	
	Возврат Результат;
	
КонецФункции

Функция УдалитьПользователяИБ_(Пользователь) Экспорт
	
	Если ТипЗнч(Пользователь) = Тип("Строка") Тогда
		Если ПустаяСтрока(Пользователь) Тогда
			Возврат Истина;
		КонецЕсли;		
		Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(СокрЛП(Пользователь));
		Если Пользователь = Неопределено ИЛИ Пользователь.Имя = "Администратор" Тогда
			Возврат Истина;
		КонецЕсли; 	
	КонецЕсли;
	
	Попытка
		Пользователь.Удалить();
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

