
&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	//АдминистрированиеСервера = Новый АдминистрированиеСервера("dev-1c-iota", Число(15450));  
	//МассивКластеров = АдминистрированиеСервера.ПолучитьКластеры();
	//Для Каждого Кластер Из МассивКластеров Цикл 
	//	Кластер.ПолучитьСеансы();
	//КонецЦикла;
	
	//ПараметрыИБ = АдминистрированиеКластераВызовСервера.ПараметрыАдминистрированияИнформационнойБазыКластера();
	//ЗаполнитьЗначенияСвойств(ПараметрыИБ, АдминистративныеФункции.ПараметрыВременногоПользователя()); 
	
	//ОбменДанными.ЗаверщитьДублиСеансов();
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	ОбъектФормы.ЗавершитьНекорректныеСеансы();
	
КонецПроцедуры    
